In [2]:
people = {
    "first": ['Jack', 'James', 'Liam', 'Steve'],
    "last": ['Simons', 'Simons', 'Payne', 'Rogers'],
    "email":['jsim@demo.com', 'jkab@demo.com', 
             'lpayne@demo.com', 'captain@demo.com']
}

import pandas as pd

df = pd.DataFrame(people)
df

   first    last             email
0   Jack  Simons     jsim@demo.com
1  James  Simons     jkab@demo.com
2   Liam   Payne   lpayne@demo.com
3  Steve  Rogers  captain@demo.com

   # Creating a new column

In [3]:
df['first'] + ' ' + df['last']

0     Jack Simons
1    James Simons
2      Liam Payne
3    Steve Rogers
dtype: object

In [4]:
df['full_name'] = df['first'] + ' ' + df['last']
df
# we don't use the 'dot' notation coz the python would think that 
# we are going to assign an attr to the dataframe obj not a col

   first    last             email     full_name
0   Jack  Simons     jsim@demo.com   Jack Simons
1  James  Simons     jkab@demo.com  James Simons
2   Liam   Payne   lpayne@demo.com    Liam Payne
3  Steve  Rogers  captain@demo.com  Steve Rogers

# Dropping some columns

In [5]:
df.drop(columns=['first', 'last'], inplace=True)

In [6]:
df

              email     full_name
0     jsim@demo.com   Jack Simons
1     jkab@demo.com  James Simons
2   lpayne@demo.com    Liam Payne
3  captain@demo.com  Steve Rogers

# Creating columns from the existing column's data

In [7]:
df['full_name'].str.split(' ', expand=True)
# expand -> expanding a list of items into columns

       0       1
0   Jack  Simons
1  James  Simons
2   Liam   Payne
3  Steve  Rogers

In [8]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)
df

              email     full_name  first    last
0     jsim@demo.com   Jack Simons   Jack  Simons
1     jkab@demo.com  James Simons  James  Simons
2   lpayne@demo.com    Liam Payne   Liam   Payne
3  captain@demo.com  Steve Rogers  Steve  Rogers

# Adding a single row of data

In [9]:
df.append({'first':'Sam'}, ignore_index=True)
# since there's no index in the specification above, we would get an error
# if we don't specify the 'ignore_index=True'<- the index is set automatically

              email     full_name  first    last
0     jsim@demo.com   Jack Simons   Jack  Simons
1     jkab@demo.com  James Simons  James  Simons
2   lpayne@demo.com    Liam Payne   Liam   Payne
3  captain@demo.com  Steve Rogers  Steve  Rogers
4               NaN           NaN    Sam     NaN


# Appending a dframe with an existing dframe

In [10]:
people = {
    "first": ['Peter', 'Bruce'],
    "last": ['Parker', 'Banner'],
    "email":['p.parker@ave.com', 'b.banner@ave.com']
}
df2 = pd.DataFrame(people)
df2

   first    last             email
0  Peter  Parker  p.parker@ave.com
1  Bruce  Banner  b.banner@ave.com

In [11]:
df = df.append(df2, ignore_index=True)
# we could have pass sort=False(<- coz we could get a warning that we did not
# pass col.s in the same order btween dframes, sort would avoid that.)
# ^ We can ignore that coz sort=False is set by def!
df

              email     full_name  first    last
0     jsim@demo.com   Jack Simons   Jack  Simons
1     jkab@demo.com  James Simons  James  Simons
2   lpayne@demo.com    Liam Payne   Liam   Payne
3  captain@demo.com  Steve Rogers  Steve  Rogers
4  p.parker@ave.com           NaN  Peter  Parker
5  b.banner@ave.com           NaN  Bruce  Banner

# Dropping by an index

In [12]:
df.drop(index=5, inplace=True)
df

              email     full_name  first    last
0     jsim@demo.com   Jack Simons   Jack  Simons
1     jkab@demo.com  James Simons  James  Simons
2   lpayne@demo.com    Liam Payne   Liam   Payne
3  captain@demo.com  Steve Rogers  Steve  Rogers
4  p.parker@ave.com           NaN  Peter  Parker

# Dropping using conditionals

In [13]:
filt = df['last'] == 'Simons'
df.drop(index=df[filt].index)
# since we need indexes, we use .index

              email     full_name  first    last
2   lpayne@demo.com    Liam Payne   Liam   Payne
3  captain@demo.com  Steve Rogers  Steve  Rogers
4  p.parker@ave.com           NaN  Peter  Parker

# Dropping by a row

In [14]:
df.drop([2,3], axis=0, inplace=True)
# axis=0 is saying to drop in the row direction. <- is a default
df

              email     full_name  first    last
0     jsim@demo.com   Jack Simons   Jack  Simons
1     jkab@demo.com  James Simons  James  Simons
4  p.parker@ave.com           NaN  Peter  Parker